[
  {
    "img_url": "https://images.igdb.com/igdb/image/upload/t_cover_big/co9gan.webp",
    "title": "Clair Obscur: Expedition 33",
    "platform": "PC (Microsoft Windows), PlayStation 5, Xbox Series X|S",
    "studio": "Sandfall Interactive",
    "release_year": "2025",
    "description": "\"Year by year, She erases us.\"\n\nOnce a year, the Paintress wakes and paints upon her monolith. Paints her cursed number. And everyone of that age turns to smoke and fades away. Year by year, that number ticks down and more of us are erased. Tomorrow she’ll wake and paint “33.” And tomorrow we depart on our final mission - Destroy the Paintress, so she can never paint death again. We are Expedition 33.\n\nClair Obscur: Expedition 33 is a ground-breaking turn-based RPG with unique real-time mechanics, making battles more immersive and addictive than ever. Explore a fantasy world inspired by Belle Époque France in which you battle devastating enemies.",
    "price": 3599
  },
  {
    "img_url": "https://images.igdb.com/igdb/image/upload/t_cover_big/coaend.webp",
    "title": "Hollow Knight: Silksong",
    "platform": "Nintendo Switch, Nintendo Switch 2, PC (Microsoft Windows), PlayStation 4, PlayStation 5, Xbox One, Xbox Series X|S",
    "studio": "Team Cherry",
    "release_year": "2025",
    "description": "If you love great art and Metroidvanias, you've probably played Team Cherry's Hollow Knight. The developers are hard at work on its sequel - Silksong - which continues the story of the Hallownest and brings back the series' tough-as-nails Dark Souls style boss fights, alongside level exploration that unlocks more and more as you get new abilities and items.\n\nHollow Knight Silksong will follows on from the events of the first game, which was one of the most lauded indie games of 2017. So, if you’re looking forward to returning to the Hallownest as a new character and continuing the story of the first game, you will want to know the Hollow Knight Silksong release date so that you can prepare.",
    "price": 880
  },
  {
    "img_url": "https://images.igdb.com/igdb/image/upload/t_cover_big/co9ipx.webp",
    "title": "Death Stranding 2: On The Beach",
    "platform": "PlayStation 5",
    "studio": "Kojima Productions - Sony Interactive Entertainment",
    "release_year": "2025",
    "description": "Death Stranding 2: On the Beach is a 2025 action-adventure game developed by Kojima Productions and published by Sony Interactive Entertainment. It is the sequel to Death Stranding, and is written, produced, and directed by Hideo Kojima. It is also the second game of Kojima Productions as an independent entity and the studio's second collaboration with Sony. The title features the previous game's central characters, including Sam Porter Bridges, Fragile, and Higgs, reprised by Norman Reedus, Lea Seydoux, and Troy Baker, respectively. They are joined by a new cast consisting of Elle Fanning, Shioli Kutsuna, Luca Marinelli, Alastair Duncan, Alissa Jung and Debra Wilson, as well as special appearances from George Miller, Fatih Akin, and Nicolas Winding Refn, the latter reprising his role from the first game.\n\nDeath Stranding 2: On the Beach is set primarily in Australia, eleven months after the events of the first game, in a post-apocalyptic world ravaged by otherworldly creatures. The player controls Sam Porter Bridges, a freelance porter, as he and his companions set out on an expedition across the Australian continent to connect isolated survivors and colonies to the wireless communications 'chiral' network in order to save humanity from extinction.",
    "price": 4999
  },
  {
    "img_url": "https://images.igdb.com/igdb/image/upload/t_cover_big/co9wzc.webp",
    "title": "Pokémon Legends: Z-A",
    "platform": "Nintendo Switch, Nintendo Switch 2",
    "studio": "Game Freak - Nintendo",
    "release_year": "2025",
    "description": "Pokemon Legends: Z-A is a bold reimagining of the Pokemon universe, set entirely within Lumiose City in the Kalos region, which is undergoing a futuristic transformation to better integrate Pokemon and human life. Departing from traditional gameplay, it introduces real-time battles where trainers actively command their Pokemon in dynamic environments, adding layers of strategy through movement, timing, and attack range. Players begin their journey with one of three classic starters—Chikorita, Tepig, or Totodile—and explore a narrative centered on coexistence and urban renewal. A major highlight is the return of Mega Evolutions, including new forms for iconic Pokemon like Zygarde and Starmie, enhancing both combat and lore. The game also features the Z-A Royale, a competitive nightly event that challenges players to rise through ranks and earn exclusive rewards. Released globally on October 16, 2025, for Nintendo Switch and Switch 2, Pokemon Legends: Z-A blends nostalgia with innovation, offering a fresh, immersive experience for longtime fans and newcomers alike.",
    "price": 5500
  }
]
